cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "neovim/neovim"

# Install Xcode before anything else. Some dependencies depend on it being installed.

mas "xcode", id: 497799835

brew "cask"
brew "carthage"
brew "coreutils"
brew "dark-mode"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gnupg"
brew "golang"
brew "gpg-agent"
brew "grep"
brew "htop"
brew "jq"
brew "mas"
brew "mcrypt"
brew "neovim"
brew "openssl"
brew "pandoc"
brew "python"
brew "python3"
brew "rsync"
brew "stow"
brew "swiftlint"
brew "terraform"
brew "trash"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh-completions"

cask "charles"
cask "diffmerge"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "paw"
cask "postico"
cask "sketch"
cask "skype"
cask "sublime-text"
cask "vlc"
cask "1password"

mas "bear", id: 1091189122
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
