cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "neovim/neovim"

# Install Xcode before anything else. Some dependencies depend on it being installed.

# # # mas "xcode", id: 497799835

brew "cask"
brew "carthage"
brew "coreutils"
brew "dark-mode"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gnupg"
brew "golang"
brew "gpg-agent"
brew "grep"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mcrypt"
brew "neovim"
brew "openssl"
brew "p7zip"
brew "pandoc"
brew "python"
brew "python3"
brew "rsync"
brew "speedtest-cli"
brew "stow"
brew "swiftlint"
brew "terraform"
brew "trash"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh-completions"

cask "bartender"
cask "caffeine"
cask "calibre"
cask "charles"
cask "diffmerge"
cask "docker"
cask "dropbox"
cask "flux"
cask "franz"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "hazel"
cask "iterm2"
cask "keybase"
cask "kindle"
cask "macdown"
cask "nordvpn"
cask "paw"
cask "postico"
cask "sketch"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "vlc"
cask "1password"

# Install quicklook plugins with brew-cask (https://github.com/sindresorhus/quick-look-plugins)

cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

mas "bear", id: 1091189122
mas "irvue", id: 1039633667
mas "parcel", id: 639968404
mas "pocket", id: 568494494
mas "tweetbot", id: 557168941
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
